{"incident_id": "5375", "summary_detail": {"base": "", "type": "text/html", "value": "Lolo Peak Fire Update  Monday, September 4, 2017; 8:30 AM Northern Rockies Incident Management Team  Doug Turman, Incident CommanderFire origin: July 15, 2017, ten miles southwest of Lolo, MT.Fire Information: (406) 272-5433 Hours: 7am – 9pmEmail: LoloPeakFire@gmail.comWebsites: Inciweb: http://inciweb.nwcg.gov/incident/5375 Missoula County Sheriff: http://tinyurl.com/ya93jpuf Ravalli County: http://ravalli.us/557/Fire-Incident-InformationFacebook: Bitterroot National Forest Facebook Page Lolo National Forest Facebook Page  RED FLAG WARNING IN EFFECT FROM UNTIL 9 A.M. MONDAY Weather: A Red Flag Warning is in effect until 9:00am today for high temperatures, low humidity and gusty winds.  Fire Information Locations: Staffed fire information locations are at Super 1 Foods in Stevensville and Farmers State Bank in Florence. Fire information is also available at the weigh station in Lolo at the corner of Highways 12 and 93. Evacuations: An Evacuation Order is in effect for all residents...", "language": null}, "links": [{"href": "https://inciweb.nwcg.gov/incident/article/5375/39945/", "type": "text/html", "rel": "alternate"}], "published_parsed": null, "title": "Update Lolo Peak - September 4, 2017 (Lolo Peak Fire Wildfire)", "summary": "Lolo Peak Fire Update  Monday, September 4, 2017; 8:30 AM Northern Rockies Incident Management Team  Doug Turman, Incident CommanderFire origin: July 15, 2017, ten miles southwest of Lolo, MT.Fire Information: (406) 272-5433 Hours: 7am – 9pmEmail: LoloPeakFire@gmail.comWebsites: Inciweb: http://inciweb.nwcg.gov/incident/5375 Missoula County Sheriff: http://tinyurl.com/ya93jpuf Ravalli County: http://ravalli.us/557/Fire-Incident-InformationFacebook: Bitterroot National Forest Facebook Page Lolo National Forest Facebook Page  RED FLAG WARNING IN EFFECT FROM UNTIL 9 A.M. MONDAY Weather: A Red Flag Warning is in effect until 9:00am today for high temperatures, low humidity and gusty winds.  Fire Information Locations: Staffed fire information locations are at Super 1 Foods in Stevensville and Farmers State Bank in Florence. Fire information is also available at the weigh station in Lolo at the corner of Highways 12 and 93. Evacuations: An Evacuation Order is in effect for all residents...", "content": "<div id=\"content\">\n<h3>Update Lolo Peak - September 4, 2017</h3><p><strong>Incident:</strong> Lolo Peak Fire Wildfire<br/><strong>Released:</strong> 12 min. ago</p><p align=\"center\" style=\"text-align: left;\"><b>Lolo Peak Fire Update</b> </p> <p align=\"center\" style=\"text-align: left;\"><font size=\"5\">Monday, September 4, 2017; 8:30 AM</font></p> <p align=\"center\" style=\"text-align: left;\"><font size=\"5\">Northern Rockies Incident Management Team </font></p> <p align=\"center\" style=\"text-align: left;\"><font size=\"5\">Doug Turman, Incident Commander<br/><br/></font></p><p><font size=\"5\"><b>Fire origin</b><b>: </b>July 15, 2017, ten miles southwest of Lolo, MT.<b></b></font></p><p><font size=\"5\"><b>Fire Information</b>: (406) 272-5433 Hours: 7am – 9pm</font></p><p><font size=\"5\"><b>Email: </b><a href=\"mailto:easternmtimt2@gmail.com\"></a><a href=\"mailto:LoloPeakFire@gmail.com\">LoloPeakFire@gmail.com</a></font></p><p><font size=\"5\"><b>Websites</b>: Inciweb: <a href=\"http://inciweb.nwcg.gov/incident/5375\">http://inciweb.nwcg.gov/incident/5375</a></font></p><p><font size=\"5\"> Missoula County Sheriff: <a href=\"http://tinyurl.com/ya93jpuf\">http://tinyurl.com/ya93jpuf</a></font></p><p><font size=\"5\"> Ravalli County: <a href=\"http://ravalli.us/557/Fire-Incident-Information\">http://ravalli.us/557/Fire-Incident-Information</a></font></p><p><font size=\"5\"><b>Facebook: </b>Bitterroot National Forest Facebook Page</font></p><p><font size=\"5\"> Lolo National Forest Facebook Page<b></b></font></p><p><b><font size=\"5\"> </font></b></p><p><font size=\"5\"><b><i> </i></b><b><i>RED FLAG WARNING IN EFFECT FROM UNTIL 9 A.M. MONDAY</i></b><b></b></font></p><p><b><font size=\"5\"> </font></b></p><p><font size=\"5\"><b>Weather:</b> A Red Flag Warning is in effect until 9:00am today for high temperatures, low humidity and gusty winds. </font></p><p><font size=\"5\"><b><br/> Fire Information Locations:</b> Staffed fire information locations are at </font></p><p><font size=\"5\">Super 1 Foods in Stevensville and Farmers State Bank in Florence. Fire information is also available at the weigh station in Lolo at the corner of Highways 12 and 93.</font></p><p><font size=\"5\"> </font></p><p><font size=\"5\"><b>Evacuations: </b>An Evacuation Order is in effect for all residents west of Highway 93 on the north side of Bass Creek Road north to residents on the south side of Hannaford Avenue and west of Florence Carlton Loop. </font></p><p><b><font size=\"5\"> </font></b></p><p><font size=\"5\"><b>Warnings</b>: The Evacuation Warning area has been expanded south to include all residents on the south side of Bass Creek Road and west of Highway 93 to South Kootenia Creek Road, including Redtail Hawk Lane. The evacuation warning remains in effect from Hannaford Avenue north to West County Lane Road and west of Highway 93 as well as in the Bear Creek and Elk Creek areas on Highway 12 east of Lolo. </font></p><p><font size=\"5\"> </font></p><p><font size=\"5\">The Evacuation warning is lifted in the Highway 12 corridor from mile marker 24 (near and including Arena Drive) to the Highway 93 junction in Lolo. The evacuation warning was also lifted for residents in the Highway 93 corridor from the Highway 12 junction to mile marker 79 (near and including the Gravel Pit off of Old Highway 93 and the McClain Creek Road). </font></p><p><font size=\"5\"> </font></p><p><font size=\"5\">For current evacuation information, visit the Missoula County and Ravalli County Sheriffs’ Facebook pages. </font></p><p><font size=\"5\"> </font></p><p><b><u><font size=\"5\">45 mPH speed limit through the fire area - HIGHWAYS ARE OPEN. </font></u></b></p><p><font size=\"5\"><br/> <b>Summary:</b> The decision to order evacuations was made Sunday morning in an effort to provide for the safety of citizens due to the forecasted weather and expected extreme fire behavior.</font></p><p><font size=\"5\"> </font></p><p><font size=\"5\">The fire was very active overnight due to a strong thermal belt. Torching sub-alpine fir trees caused spot fires on the western edge of the fire that grew to a 300 acre area outside of the primary containment line. Indirect lines will be identified, constructed and used to contain this new fire edge. The uncontained fire has the potential to move toward Highway 12. The fire moved approximately 3 miles to the east in the North Fork of Sweeney Creek. Helicopters dropped retardant on the ridge to check the fire at the mouth of Sweeney Creek and firefighters were successful in holding that line.</font></p><p><font size=\"5\"> </font></p><p><font size=\"5\">Monitor and patrol status continues on the north and northeast sides of the fire. Mop up began in the One Horse drainage and preparations for burnout operations were completed in Sweeney Creek. The burnout will connect previously burned areas forming a continuous buffer along the southeast side of the fire. </font></p><p><font size=\"5\"> </font></p><p><font size=\"5\">Suppression repair work continues to repair areas damaged during earlier phases of fire control efforts. Members of the National Guard are present to support the Ravalli County Sheriff’s Department in providing security at the existing road blocks. </font></p><p><b><font size=\"5\"> </font></b></p><p><font size=\"5\"><b>Today</b>: Crews will focus on Upper and Lower Sweeney Creek while they continue to assess areas for opportunities to mitigate risk and engage in suppression activities to stay ahead of the interior fire front. The high pressure system has moved over the fire and changing winds are expected throughout the day. Fire is expected to be active in areas that have not been exposed to wind recently. The public may see isolated tree torching from deep inside the fire line as wind kicks up flames that consume unburned pockets of fuel. Air support for the fire will be limited due poor visibility until the inversion lifts. </font></p><p><font size=\"5\"> </font></p><p><font size=\"5\"><b>Please do not stop along the highways to view fire activity</b>. It creates a significant traffic hazard, impedes firefighter traffic, and impacts the safety of firefighters and citizens. </font></p><p><b><font size=\"5\"> </font></b></p><p><font size=\"5\"><b>Firewise</b>: For information on how to improve the chances of your homes and structures surviving a wildfire, visit the Firewise website at <a href=\"http://www.firewise.org/\">www.Firewise.org</a>.</font></p><p><font size=\"5\"> </font></p><font size=\"5\"><b>Evacuation/Closure Information</b>: Evacuations and road closures are based upon the need to provide for safety of the public and firefighters, current fire behavior, forecasted weather, and planned suppression operations. Fire officials, Missoula and Ravalli County Sheriff’s Offices, and Montana Department of Transportation will evaluate the evacuation and road closures daily. The Incident Commander, Missoula County Rural Fire Chief, Ravalli County Fire Warden, and the Missoula and Ravalli County Sheriffs appreciate your patience and will work hard to get you back into your homes as soon as it is safe to do so. Go to the Sheriffs Offices’ Facebook pages for the most current information.</font><b><font size=\"5\"> </font></b><font size=\"5\"><b>Drones and TFR: </b>The Temporary Flight Restriction (TFR) for the Lolo Peak Fire remains in effect. <b>The restriction includes “drones” or unmanned aerial vehicles. If drones are detected, air operations stop</b>. <b>“<u>If you fly, we can’t!</u> </b>If you see a drone in the fire area, including the evacuation areas, report it immediately to 406-272-5433. Please provide your name, phone number, location and time you observed the drone. Your cooperation is needed to insure the safety of our pilots.</font><p><font size=\"5\"><b>Stage II Fire Restrictions</b> are in effect for Missoula and Ravalli Counties and across the Lolo and Bitterroot National Forests. Additional information can be found on Inciweb.</font></p><p><font size=\"5\"> </font></p><p><font size=\"5\"><b>Closures:</b> For specific area closure information on the Lolo and Bitterroot National Forests please visit the Inciweb website, the Lolo National Forest website and/or the Bitterroot National Forest website.</font></p><p><font size=\"5\"> </font></p><p><font size=\"5\"><b>Jurisdiction:</b> The fire is under the jurisdiction of the Lolo and Bitterroot National Forests and the Montana Department of Natural Resources (MTDNRC). It is being managed under unified command consisting of Incident Commander Turman, Missoula Rural Fire Chief Newman and Ravalli County Fire Warden Mohn. </font></p><p><font size=\"5\"> </font></p><p>Missoula County residents can receive emergency notifications of critical alerts via their choice of text, phone and/or email by signing up at <b>Smart911.com</b>. Residents in Ravalli County can download the <b>Ravalli County Sheriff’s app</b> to their mobile devices to receive critical information notifications.</p><b> </b><p align=\"center\"> <b>Cooperators:</b> Stevensville, Ravalli &amp; Missoula County Government; Ravalli and Missoula County Sheriffs' Offices; Missoula Rural Fire; Florence VFD; Florence – Carlton School District; Nez Perce Tribe; Confederated Salish and Kootenai Tribes; MDOT; Carlton and Bass Lake Irrigation; Ravalli and Missoula County DES; Private Landowners. </p>\n</div>", "guidislink": false, "title_detail": {"base": "", "type": "text/plain", "value": "Update Lolo Peak - September 4, 2017 (Lolo Peak Fire Wildfire)", "language": null}, "link": "https://inciweb.nwcg.gov/incident/article/5375/39945/", "published": "Mon, 04 Sep 2017 09:48:00 -05:00", "article_id": "39945", "id": "https://inciweb.nwcg.gov/incident/article/5375/39945/"}