{"incident_id": "5375", "summary_detail": {"base": "", "type": "text/html", "value": "Lolo Peak Fire UpdateSunday, September 3, 2017; 8:30 AMNorthern Rockies Incident Management TeamDoug Turman, Incident Commander Fire origin: July 15, 2017, ten miles southwest of Lolo, MT.Fire Information: (406) 272-5433 Hours: 7am – 9pmEmail: LoloPeakFire@gmail.comWebsites: Inciweb: http://inciweb.nwcg.gov/incident/5375 Missoula County Sheriff: http://tinyurl.com/ya93jpuf Ravalli County: http://ravalli.us/557/Fire-Incident-InformationFacebook: Bitterroot National Forest Facebook Page Lolo National Forest Facebook Page  RED FLAG WARNING IN EFFECT FROM UNTIL 9 P.M. SUNDAY Weather: A Red Flag Warning is in effect until 9:00pm today for high temperatures, low humidity and gusty winds.  Fire Information Locations: Staffed fire information locations are at Super 1 Foods in Stevensville and Farmers State Bank in Florence. Fire information is also available at the weigh station in Lolo at the corner of Highways 12 and 93. Evacuations and Warnings: The evacuation warning status lifted for...", "language": null}, "links": [{"href": "https://inciweb.nwcg.gov/incident/article/5375/39818/", "type": "text/html", "rel": "alternate"}], "published_parsed": null, "title": "Update - Lolo Peak September 3, 2017 (Lolo Peak Fire Wildfire)", "summary": "Lolo Peak Fire UpdateSunday, September 3, 2017; 8:30 AMNorthern Rockies Incident Management TeamDoug Turman, Incident Commander Fire origin: July 15, 2017, ten miles southwest of Lolo, MT.Fire Information: (406) 272-5433 Hours: 7am – 9pmEmail: LoloPeakFire@gmail.comWebsites: Inciweb: http://inciweb.nwcg.gov/incident/5375 Missoula County Sheriff: http://tinyurl.com/ya93jpuf Ravalli County: http://ravalli.us/557/Fire-Incident-InformationFacebook: Bitterroot National Forest Facebook Page Lolo National Forest Facebook Page  RED FLAG WARNING IN EFFECT FROM UNTIL 9 P.M. SUNDAY Weather: A Red Flag Warning is in effect until 9:00pm today for high temperatures, low humidity and gusty winds.  Fire Information Locations: Staffed fire information locations are at Super 1 Foods in Stevensville and Farmers State Bank in Florence. Fire information is also available at the weigh station in Lolo at the corner of Highways 12 and 93. Evacuations and Warnings: The evacuation warning status lifted for...", "content": "<div id=\"content\">\n<h3>Update - Lolo Peak September 3, 2017</h3><p><strong>Incident:</strong> Lolo Peak Fire Wildfire<br/><strong>Released:</strong> 19 min. ago</p><p><b style=\"text-align: center; font-size: 11.008px;\">Lolo Peak Fire Update<br/></b><font size=\"5\">Sunday, September 3, 2017; 8:30 AM<br/>Northern Rockies Incident Management Team<br/>Doug Turman, Incident Commander</font><br/> <br/></p><p><font size=\"5\"><b>Fire origin</b><b>: </b>July 15, 2017, ten miles southwest of Lolo, MT.<b></b></font></p><p><font size=\"5\"><b>Fire Information</b>: (406) 272-5433 Hours: 7am – 9pm</font></p><p><font size=\"5\"><b>Email: </b><a href=\"mailto:easternmtimt2@gmail.com\"></a><a href=\"mailto:LoloPeakFire@gmail.com\">LoloPeakFire@gmail.com</a></font></p><p><font size=\"5\"><b>Websites</b>: Inciweb: <a href=\"http://inciweb.nwcg.gov/incident/5375\">http://inciweb.nwcg.gov/incident/5375</a></font></p><p><font size=\"5\"> Missoula County Sheriff: <a href=\"http://tinyurl.com/ya93jpuf\">http://tinyurl.com/ya93jpuf</a></font></p><p><font size=\"5\"> Ravalli County: <a href=\"http://ravalli.us/557/Fire-Incident-Information\">http://ravalli.us/557/Fire-Incident-Information</a></font></p><p><font size=\"5\"><b>Facebook: </b>Bitterroot National Forest Facebook Page</font></p><p><font size=\"5\"> Lolo National Forest Facebook Page<b></b></font></p><p><b><font size=\"5\"> </font></b></p><p><font size=\"5\"><b><i> </i></b><b><i>RED FLAG WARNING IN EFFECT FROM UNTIL 9 P.M. SUNDAY</i></b><b></b></font></p><p><b><font size=\"5\"> </font></b></p><p><font size=\"5\"><b>Weather:</b> A Red Flag Warning is in effect until 9:00pm today for high temperatures, low humidity and gusty winds. </font></p><p><font size=\"5\"><b><br/> Fire Information Locations:</b> Staffed fire information locations are at </font></p><p><font size=\"5\">Super 1 Foods in Stevensville and Farmers State Bank in Florence. Fire information is also available at the weigh station in Lolo at the corner of Highways 12 and 93.</font></p><p><font size=\"5\"> </font></p><p><font size=\"5\"><b>Evacuations and Warnings</b>: The evacuation warning status lifted for residents living in certain sections of the highway 12 and 93 corridors. The warning is lifted in the Highway 12 corridor from mile marker 24 (near and including Arena Drive) to the Highway 93 junction in Lolo. The evacuation warning was also lifted for residents in the Highway 93 corridor from the Highway 12 junction to mile marker 79 (near and including the Gravel Pit off of Old Highway 93 and the McClain Creek Road). </font></p><p><font size=\"5\"> </font></p><p><font size=\"5\">The evacuation warning remains in place in the Bear Creek and Elk Creek areas on Highway 12 east of Lolo and in the Highway 93 corridor from McClain Creek Road south to Bass Creek Road. There are no evacuation orders at this time, but this could change based on fire behavior.<b> </b>For current information visit the Missoula County and Ravalli County Sheriffs’ Facebook pages. </font></p><p><font size=\"5\"> </font></p><p><b><u><font size=\"5\">45 mPH speed limit through the fire area - HIGHWAYS ARE OPEN. </font></u></b></p><p><font size=\"5\"><br/> <b>Summary:</b> One team of firefighters responded to a spot fire on the western edge of the fire in the Upper East Fork area that resulted from fire activity and gusty winds. Aircraft and engines took direct suppression actions on the fire which continued through the night. Firefighters continued to reinforce the strategically burned out buffer areas connecting One Horse and Sweeney Creek drainages with support from Helicopters. </font></p><p><font size=\"5\"> </font></p><p><font size=\"5\">Smoke and fire was visible throughout the area due to increased fire activity in the South Fork of Lolo Creek, the One Horse Drainage, the upper end of Sweeney Creek, and the northwestern side of the fire where it continues to work through pockets of timber that were previously unburned. Patrolling, monitoring and mop up efforts continue on the north, northwest and northeast sides of the fire. Fire progression is being actively monitored on the southwestern edge.</font></p><p><font size=\"5\"> </font></p><p><font size=\"5\">Suppression repair work is occurring to repair areas damaged during earlier phases of fire control efforts. Members of the National Guard continue to support the Ravalli County Sheriff’s Department providing security at the existing road blocks. </font></p><p><b><font size=\"5\"> </font></b></p><p><font size=\"5\"><b>Today</b>: Fire is expected to be active today in the One Horse and Sweeney Creek drainages. The public may see isolated tree torching from deep inside the fire line as wind kicks up flames that consume unburned pockets of fuel. </font></p><p><font size=\"5\">As a result of the red flag conditions, these areas are expected to produce significant amounts of smoke, and smoke columns will be visible from the Highway 93 corridor. Nearby fires in northern Idaho and western Montana will also be experiencing increased activity brining more smoke into the area.</font></p><p><font size=\"5\"> </font></p><p><font size=\"5\"><b>Please do not stop along the highways to view fire activity</b>. It creates a significant traffic hazard, impedes firefighter traffic, and impacts the safety of firefighters and citizens. </font></p><p><b><font size=\"5\"> </font></b></p><p><font size=\"5\"><b>Firewise</b>: For information on how to improve the chances of your homes and structures surviving a wildfire, visit the Firewise website at <a href=\"http://www.firewise.org/\">www.Firewise.org</a>.</font></p><p><font size=\"5\"> </font></p><font size=\"5\"><b>Evacuation/Closure Information</b>: Evacuations and road closures are based upon the need to provide for safety of the public and firefighters, current fire behavior, forecasted weather, and planned suppression operations. Fire officials, Missoula and Ravalli County Sheriff’s Offices, and Montana Department of Transportation will evaluate the evacuation and road closures daily. The Incident Commander, Missoula County Rural Fire Chief, Ravalli County Fire Warden, and the Missoula and Ravalli County Sheriffs appreciate your patience and will work hard to get you back into your homes as soon as it is safe to do so. Go to the Sheriffs Offices’ Facebook pages for the most current information.</font></div>", "guidislink": false, "title_detail": {"base": "", "type": "text/plain", "value": "Update - Lolo Peak September 3, 2017 (Lolo Peak Fire Wildfire)", "language": null}, "link": "https://inciweb.nwcg.gov/incident/article/5375/39818/", "published": "Sun, 03 Sep 2017 09:11:00 -05:00", "article_id": "39818", "id": "https://inciweb.nwcg.gov/incident/article/5375/39818/"}