{"incident_id": "5375", "summary_detail": {"base": "", "type": "text/html", "value": "Lolo Peak Fire UpdateSaturday, September 2, 2017; 8:30 AMNorthern Rockies Incident Management TeamDoug Turman, Incident CommanderFire origin: July 15, 2017, ten miles southwest of Lolo, MT. Fire Information: (406) 272-5433 Hours: 7am – 9pm Email: LoloPeakFire@gmail.com Websites: Inciweb: http://inciweb.nwcg.gov/incident/5375  Missoula County Sheriff: http://tinyurl.com/ya93jpuf  Ravalli County: http://ravalli.us/557/Fire-Incident-Information Facebook: Bitterroot National Forest Facebook Page  Lolo National Forest Facebook Page   Weather: A fire weather watch has been issued through Sunday with high temperatures, low humidity and gusty winds expected.   Fire Information Locations: Staffed fire information locations are at  Super 1 Foods in Stevensville and Farmers State Bank in Florence. Fire information is also available at the weigh station in Lolo at the corner of Highways 12 and 93.   Evacuations and Warnings: The evacuation warning status lifted for residents living in certain...", "language": null}, "links": [{"href": "https://inciweb.nwcg.gov/incident/article/5375/39709/", "type": "text/html", "rel": "alternate"}], "published_parsed": null, "title": "Update - Lolo Peak September 2, 2017 (Lolo Peak Fire Wildfire)", "summary": "Lolo Peak Fire UpdateSaturday, September 2, 2017; 8:30 AMNorthern Rockies Incident Management TeamDoug Turman, Incident CommanderFire origin: July 15, 2017, ten miles southwest of Lolo, MT. Fire Information: (406) 272-5433 Hours: 7am – 9pm Email: LoloPeakFire@gmail.com Websites: Inciweb: http://inciweb.nwcg.gov/incident/5375  Missoula County Sheriff: http://tinyurl.com/ya93jpuf  Ravalli County: http://ravalli.us/557/Fire-Incident-Information Facebook: Bitterroot National Forest Facebook Page  Lolo National Forest Facebook Page   Weather: A fire weather watch has been issued through Sunday with high temperatures, low humidity and gusty winds expected.   Fire Information Locations: Staffed fire information locations are at  Super 1 Foods in Stevensville and Farmers State Bank in Florence. Fire information is also available at the weigh station in Lolo at the corner of Highways 12 and 93.   Evacuations and Warnings: The evacuation warning status lifted for residents living in certain...", "content": "<div id=\"content\">\n<h3>Update - Lolo Peak September 2, 2017</h3><p><strong>Incident:</strong> Lolo Peak Fire Wildfire<br/><strong>Released:</strong> 4 hrs. ago</p><p><b style=\"text-align: center; font-size: 11.008px;\">Lolo Peak Fire Update<br/></b><font size=\"5\">Saturday, September 2, 2017; 8:30 AM<br/>Northern Rockies Incident Management Team<br/>Doug Turman, Incident Commander<br/><br/></font></p><p><font size=\"5\"><b>Fire origin</b><b>: </b>July 15, 2017, ten miles southwest of Lolo, MT.<b></b></font></p> <p><font size=\"5\"><b>Fire Information</b>: (406) 272-5433 Hours: 7am – 9pm</font></p> <p><font size=\"5\"><b>Email: </b><a href=\"mailto:easternmtimt2@gmail.com\"></a><a href=\"mailto:LoloPeakFire@gmail.com\">LoloPeakFire@gmail.com</a></font></p> <p><font size=\"5\"><b>Websites</b>: Inciweb: <a href=\"http://inciweb.nwcg.gov/incident/5375\">http://inciweb.nwcg.gov/incident/5375</a></font></p> <p><font size=\"5\"> Missoula County Sheriff: <a href=\"http://tinyurl.com/ya93jpuf\">http://tinyurl.com/ya93jpuf</a></font></p> <p><font size=\"5\"> Ravalli County: <a href=\"http://ravalli.us/557/Fire-Incident-Information\">http://ravalli.us/557/Fire-Incident-Information</a></font></p> <p><font size=\"5\"><b>Facebook: </b>Bitterroot National Forest Facebook Page</font></p> <p><font size=\"5\"> Lolo National Forest Facebook Page<b></b></font></p> <p><b><font size=\"5\"> </font></b></p> <p><font size=\"5\"><b>Weather:</b> A fire weather watch has been issued through Sunday with high temperatures, low humidity and gusty winds expected. </font></p> <p><font size=\"5\"><b><br/> Fire Information Locations:</b> Staffed fire information locations are at </font></p> <p><font size=\"5\">Super 1 Foods in Stevensville and Farmers State Bank in Florence. Fire information is also available at the weigh station in Lolo at the corner of Highways 12 and 93.</font></p> <p><font size=\"5\"> </font></p> <p><font size=\"5\"><b>Evacuations and Warnings</b>: The evacuation warning status lifted for residents living in certain sections of the highway 12 and 93 corridors. The warning is lifted in the Highway 12 corridor from mile marker 24 (near and including Arena Drive) to the Highway 93 junction in Lolo. The evacuation warning was also lifted for residents in the Highway 93 corridor from the Highway 12 junction to mile marker 79 (near and including the Gravel Pit off of Old Highway 93 and the McClain Creek Road). </font></p> <p><font size=\"5\"> </font></p> <p><font size=\"5\">The evacuation warning remains in place in the Bear Creek and Elk Creek areas on Highway 12 east of Lolo and in the Highway 93 corridor from McClain Creek Road south to Bass Creek Road. There are no evacuation orders at this time, but this could change based on fire behavior.<b> </b>For current information visit the Missoula County and Ravalli County Sheriffs’ Facebook pages. </font></p> <p><font size=\"5\"> </font></p> <p><b><u><font size=\"5\">45 mPH speed limit through the fire area - HIGHWAYS ARE OPEN. </font></u></b></p> <p><font size=\"5\"><br/> <b>Summary:</b> Throughout the day helicopters dropped retardant on the ridge north of Sweeney Creek to give firefighters time to reinforce the previously burned out buffer areas connecting One Horse and Sweeney Creek drainages. Helicopters worked to reduce the intensity of the fire as it slowly worked down the slope south of One Horse Creek by dropping small fire-starting spheres that initiate controlled fire once they hit the ground. </font></p> <p><font size=\"5\"> </font></p> <p><font size=\"5\">Smoke and fire was visible throughout the area due to fire activity in the One Horse Drainage, the upper end of Sweeney Creek, the South Fork of Lolo Creek, and the northwestern side of the fire where it continues to clean out pockets of timber that were previously unburned. </font></p> <p><font size=\"5\"> </font></p> <p><font size=\"5\">Mop up continues on the north and northwest sides of the fire, patrolling and monitoring continue on the east side . Suppression repair work has begun to repair areas damaged during suppression on the northwest side of the fire. In anticipation of increased traffic and numbers of visitors in the area over the Labor Day weekend, 54 members of the National Guard arrived in the afternoon to support the Ravalli County Sheriff’s Department providing security at the existing road blocks. </font></p> <p><font size=\"5\"> </font></p> <p><font size=\"5\"><b>Today</b>: Fire is expected to be less active today in the One Horse drainage where the fire is burning in mixed conifer fuels. The public may see isolated tree torching from deep inside the fire line as wind kicks up flames that continue to consume unburned pockets of fuel. A burnout operation is planned on the north side of Sweeney Creek when conditions allow. Burnout operations help the fire to progress in a slow, deliberate manner. Firefighters will continue to bring the fire down to the areas that have already burned in order to slow the fire’s growth in a controlled manner. Smoke will be visible from Florence and Hwy 93.</font></p> <p><font size=\"5\"> </font></p> <p><font size=\"5\"><b>Please do not stop along the highways to view fire activity</b>. It creates a significant traffic hazard, impedes firefighter traffic, impacts the safety of firefighters and citizens. </font></p> <p><b><font size=\"5\"> </font></b></p> <p><font size=\"5\"><b>Firewise</b>: For information on how to improve the chances of your homes and structures surviving a wildfire, visit the Firewise website at <a href=\"http://www.firewise.org/\">www.Firewise.org</a>.</font></p> <p><font size=\"5\"> </font></p> <font size=\"5\"><b>Evacuation/Closure Information</b>: Evacuations and road closures are based upon the need to provide for safety of the public and firefighters, current fire behavior, forecasted weather, and planned suppression operations. Fire officials, Missoula and Ravalli County Sheriff’s Offices, and Montana Department of Transportation will evaluate the evacuation and road closures daily. The Incident Commander, Missoula County Rural Fire Chief, Ravalli County Fire Warden, and the Missoula and Ravalli County Sheriffs appreciate your patience and will work hard to get you back into your homes as soon as it is safe to do so. Go to the Sheriffs Offices’ Facebook pages for the most current information.</font> <b><font size=\"5\"> </font></b> <font size=\"5\"><b>Drones and TFR: </b>The Temporary Flight Restriction (TFR) for the Lolo Peak Fire remains in effect. <b>The restriction includes “drones” or unmanned aerial vehicles. If drones are detected, air operations stop</b>. <b>“<u>If you fly, we can’t!</u> </b>If you see a drone in the fire area, including the evacuation areas, report it immediately to 406-272-5433. Please provide your name, phone number, location and time you observed the drone. Your cooperation is needed to insure the safety of our pilots.</font> <p><font size=\"5\"><b>Stage II Fire Restrictions</b> are in effect for Missoula and Ravalli Counties and across the Lolo and Bitterroot National Forests. Additional information can be found on Inciweb.</font></p> <p><font size=\"5\"> </font></p> <p><font size=\"5\"><b>Closures:</b> For specific area closure information on the Lolo and Bitterroot National Forests please visit the Inciweb website, the Lolo National Forest website and/or the Bitterroot National Forest website.</font></p> <p><font size=\"5\"> </font></p> <p><font size=\"5\"><b>Jurisdiction:</b> The fire is under the jurisdiction of the Lolo and Bitterroot National Forests and the Montana Department of Natural Resources (MTDNRC). It is being managed under unified command consisting of Incident Commander Turman, Missoula Rural Fire Chief Newman and Ravalli County Fire Warden Mohn. </font></p> <p><font size=\"5\"> </font></p> <p><font size=\"5\">Missoula County residents can receive emergency notifications of critical alerts via their choice of text, phone and/or email by signing up at <b>Smart911.com</b>. Residents in Ravalli County can download the <b>Ravalli County Sheriff’s app</b> to their mobile devices to receive critical information notifications.</font></p> <b><font size=\"5\"> </font></b> <font size=\"5\"><b>Cooperators:</b> Stevensville, Ravalli &amp; Missoula County Government; Ravalli and Missoula County Sheriffs' Offices; Missoula Rural Fire; Florence VFD; Florence – Carlton School District; Nez Perce Tribe; Confederated Salish and Kootenai Tribes; MDOT; Carlton and Bass Lake Irrigation; Ravalli and Missoula County DES; Private Landowners. </font>\n</div>", "guidislink": false, "title_detail": {"base": "", "type": "text/plain", "value": "Update - Lolo Peak September 2, 2017 (Lolo Peak Fire Wildfire)", "language": null}, "link": "https://inciweb.nwcg.gov/incident/article/5375/39709/", "published": "Sat, 02 Sep 2017 10:49:00 -05:00", "article_id": "39709", "id": "https://inciweb.nwcg.gov/incident/article/5375/39709/"}