{"incident_id": "5437", "summary_detail": {"base": "", "type": "text/html", "value": "Acres: 21,388 acres  Percent Contained: 17%Fire Information: 406-272-4354 (8:00 am to 8:00 pm)Yesterday: Yesterday’s weather lived up to predictions as a Red Flag Warning on steroids as the fire grew by almost 5000 acres. Temperatures rose to the high 80’s and low 90s along the firelines and relative humidities dropped into the single digits by mid-afternoon. While at the same time the thermal inversion held the smoke close to the ground not allowing for aerial support of fire operations until late afternoon. Fire fighters returned to the Northwest section of the fireline near the South Fork of the Jocko River as the winds & high temperatures drove the fire across the Liberty Creek Meadow up towards the 2007 Jocko Lake Fire burn scar. With the limited resources available, fire managers focused most of their efforts corralling the fire’s slop over in the southeast section of the fire while scouting for the best ways to flank the fire, the northern breakout, and pen it in against...", "language": null}, "links": [{"href": "https://inciweb.nwcg.gov/incident/article/5437/39955/", "type": "text/html", "rel": "alternate"}], "published_parsed": null, "title": "Liberty Fire Update for Labor Day, Sept, 4th, 2017 (Liberty Fire Wildfire)", "summary": "Acres: 21,388 acres  Percent Contained: 17%Fire Information: 406-272-4354 (8:00 am to 8:00 pm)Yesterday: Yesterday’s weather lived up to predictions as a Red Flag Warning on steroids as the fire grew by almost 5000 acres. Temperatures rose to the high 80’s and low 90s along the firelines and relative humidities dropped into the single digits by mid-afternoon. While at the same time the thermal inversion held the smoke close to the ground not allowing for aerial support of fire operations until late afternoon. Fire fighters returned to the Northwest section of the fireline near the South Fork of the Jocko River as the winds & high temperatures drove the fire across the Liberty Creek Meadow up towards the 2007 Jocko Lake Fire burn scar. With the limited resources available, fire managers focused most of their efforts corralling the fire’s slop over in the southeast section of the fire while scouting for the best ways to flank the fire, the northern breakout, and pen it in against...", "content": "<div id=\"content\">\n<h3>Liberty Fire Update for Labor Day, Sept, 4th, 2017</h3><p><strong>Incident:</strong> Liberty Fire Wildfire<br/><strong>Released:</strong> 18 min. ago</p><p><font face=\"'Times New Roman'\"><font size=\"3\"><b>Acres:</b> 21,388 acres <b> Percent Contained:</b> 17%<br/><b>Fire Information:</b> 406-272-4354 (8:00 am to 8:00 pm)</font></font></p><p><font face=\"'Times New Roman'\"><font size=\"3\"><b>Yesterday:</b> Yesterday’s weather lived up to predictions as a Red Flag Warning on steroids as the fire grew by almost 5000 acres. Temperatures rose to the high 80’s and low 90s along the firelines and relative humidities dropped into the single digits by mid-afternoon. While at the same time the thermal inversion held the smoke close to the ground not allowing for aerial support of fire operations until late afternoon. Fire fighters returned to the Northwest section of the fireline near the South Fork of the Jocko River as the winds &amp; high temperatures drove the fire across the Liberty Creek Meadow up towards the 2007 Jocko Lake Fire burn scar. With the limited resources available, fire managers focused most of their efforts corralling the fire’s slop over in the southeast section of the fire while scouting for the best ways to flank the fire, the northern breakout, and pen it in against the old Jocko Lakes fire scar from 2007.<br/>On the Southeast corner of the fire, crews were able to go direct and bulldozed a containment line that boxed in the previous day’s run that had jumped containment lines. However, by mid-afternoon fire activity increased and became too intense for crews to continue working and had to pull back to rally points and stage into the early evening before the fire settled down enough that crews could reengage. Hand firing operations were successfully carried off and completed by 9:15 pm, burning out fuels along portions of the new dozer line and the main fire; however, containment has not been achieved on this side of the fire yet.</font></font></p><p><font face=\"'Times New Roman'\"><font size=\"3\">Along the Eastern side of the Southern border of the fire, crews began constructing an indirect handline to enclose the fire that had jumped their containment lines and were making good progress until fire activity became too intense in their zone as well. With no air support to cool or slow down the advancing fire fronts in all three sections, like their Northern &amp; Southeastern compatriots, they too had to withdraw to a rally point and wait until the fire settled down enough in the early evening to go back into their area of operations.<br/>Finally, fire supervisors evaluated the Liberty Creek Road slop over and near-entrapment of 16 firefighters. One high point was the discovery that the fire engine left behind during the escape had survived unscathed. After the documentation of the deployment site was completed the road was cleared of downed trees, the engine was driven back to base camp to be reunited with its crew. That engine will be put back into action today.</font></font></p><p><font face=\"'Times New Roman'\"><font size=\"3\"><b>Today:</b> With the decreased resources currently assigned to the fire and the weather conditions, while remaining hot, dry and windy, not quite as severe as yesterday, crews will go out to all three sections of the fire and evaluate opportunities to continue to engage the fire safely as weather, terrain and the fire permits.</font></font></p><p><font face=\"'Times New Roman'\"><font size=\"3\">After 21 days, today is the final day for Taiga Rohrer’s Great Basin Team #3 to manage the Liberty Fire. Members of Greg Poncin’s Northern Rockies IMT #1 will be shadowing their counterparts today prior to taking over and managing both the Liberty and Rice Ridge Fires tomorrow morning at 6:00 am.</font></font></p><p><font face=\"'Times New Roman'\"><font size=\"3\"><b>Resources on the Fire:</b> <b>1</b> 20-person crews, <b>1</b> helicopter, <b>2</b> engines, <b>5</b> bulldozers, <b>6</b> skidgines, <b>10</b> water tenders, <u><b>Total: 309</b></u></font></font></p>\n</div>", "guidislink": false, "title_detail": {"base": "", "type": "text/plain", "value": "Liberty Fire Update for Labor Day, Sept, 4th, 2017 (Liberty Fire Wildfire)", "language": null}, "link": "https://inciweb.nwcg.gov/incident/article/5437/39955/", "published": "Mon, 04 Sep 2017 10:42:00 -05:00", "article_id": "39955", "id": "https://inciweb.nwcg.gov/incident/article/5437/39955/"}