{"incident_id": "5437", "summary_detail": {"base": "", "type": "text/html", "value": "EVENING PRESS RELEASESaturday, 9-2-17 8:40 pmLiberty Fire- Outside of Arlee, MT At approximately 5:10 pm several rapid wind shifts and gusts threw multiple spot fires across firelines along the Northwest section of containment lines where the South Fork of the Jocko River and Liberty Creek come together. Initial reports indicated that a total of 16 firefighters from a hand crew and crew members from an engine found themselves caught between the main fire and spot fires. 13 of them were able to escape east and out into a meadow, designated as a safety zone, on the North side of Liberty Creek. Three other firefighters attempted to escape downhill towards the Liberty Creek Road where engines were parked. The firefighters made it to the road but found themselves surrounded by heavy smoke and fire. Initial reports indicated the firefighters started to deploy their fire shelters when a fortunate shift in the wind cleared the air long enough for the firefighters to locate an escape route and...", "language": null}, "links": [{"href": "https://inciweb.nwcg.gov/incident/article/5437/39806/", "type": "text/html", "rel": "alternate"}], "published_parsed": null, "title": "Press Release: All 16 FFs safe after fire jumps containment line Saturday (Liberty Fire Wildfire)", "summary": "EVENING PRESS RELEASESaturday, 9-2-17 8:40 pmLiberty Fire- Outside of Arlee, MT At approximately 5:10 pm several rapid wind shifts and gusts threw multiple spot fires across firelines along the Northwest section of containment lines where the South Fork of the Jocko River and Liberty Creek come together. Initial reports indicated that a total of 16 firefighters from a hand crew and crew members from an engine found themselves caught between the main fire and spot fires. 13 of them were able to escape east and out into a meadow, designated as a safety zone, on the North side of Liberty Creek. Three other firefighters attempted to escape downhill towards the Liberty Creek Road where engines were parked. The firefighters made it to the road but found themselves surrounded by heavy smoke and fire. Initial reports indicated the firefighters started to deploy their fire shelters when a fortunate shift in the wind cleared the air long enough for the firefighters to locate an escape route and...", "content": "<div id=\"content\">\n<h3>Press Release: All 16 FFs safe after fire jumps containment line Saturday</h3><p><strong>Incident:</strong> Liberty Fire Wildfire<br/><strong>Released:</strong> 14 min. ago</p><p><font face=\"'Times New Roman'\"><font size=\"4\"><b>EVENING PRESS RELEASE</b><br/>Saturday, 9-2-17 8:40 pm<br/>Liberty Fire- Outside of Arlee, MT<br/> <br/>At approximately 5:10 pm several rapid wind shifts and gusts threw multiple spot fires across firelines along the Northwest section of containment lines where the South Fork of the Jocko River and Liberty Creek come together. Initial reports indicated that a total of 16 firefighters from a hand crew and crew members from an engine found themselves caught between the main fire and spot fires. 13 of them were able to escape east and out into a meadow, designated as a safety zone, on the North side of Liberty Creek.<br/> <br/>Three other firefighters attempted to escape downhill towards the Liberty Creek Road where engines were parked. The firefighters made it to the road but found themselves surrounded by heavy smoke and fire. Initial reports indicated the firefighters started to deploy their fire shelters when a fortunate shift in the wind cleared the air long enough for the firefighters to locate an escape route and make their way to safety.<br/> <br/>Currently all 16 FFs are safe and accounted for with no injuries. The 13 in the Safe Zone in the meadow north of Liberty Creek were picked up by helicopter transported directly to a rally point where the other three firefighters had already been relocated. After being medically assessed by a fireline EMT, all 16 are being transported back to the Incident Command Post at Arlee by ground transport for further assessment and debriefing.<br/> <br/>For additional information contact: 406-272-4354<br/></font></font></p>\n</div>", "guidislink": false, "title_detail": {"base": "", "type": "text/plain", "value": "Press Release: All 16 FFs safe after fire jumps containment line Saturday (Liberty Fire Wildfire)", "language": null}, "link": "https://inciweb.nwcg.gov/incident/article/5437/39806/", "published": "Sat, 02 Sep 2017 21:45:00 -05:00", "article_id": "39806", "id": "https://inciweb.nwcg.gov/incident/article/5437/39806/"}