{"incident_id": "5507", "summary_detail": {"base": "", "type": "text/html", "value": "Confederated Salish & Kootenai Division of Fire News Release  For Immediate Release September 3, 2017Red Flag Warning In Effect Until 9PM Tonight POLSON, Mont. – The Red Flag Warning issued by the National Weather Service remains a big concern for firefighters over Labor Day. The public’s continued cooperation with the Stage 2 fire restrictions is a critical step in keeping everyone safe. High temperatures, combined with low relative humidity and wind, will test the work firefighters have recently completed on the Blue Bay Fire and other fires burning on the Flathead Reservation. On the Blue Bay Fire, containment lines have been tested during the past several days of hot, windy conditions. Despite some small spot fires detected in Okie Draw, acreage remains constant at 490 acres with 80% containment. Firefighters continue to work hard extinguishing heat sources on the fire. One firefighter experiencing heat related illness was transported to the hospital Saturday evening. To...", "language": null}, "links": [{"href": "https://inciweb.nwcg.gov/incident/article/5507/39824/", "type": "text/html", "rel": "alternate"}], "published_parsed": null, "title": "Red Flag Warning In effect Until 9PM Tonight (Blue Bay Fire Wildfire)", "summary": "Confederated Salish & Kootenai Division of Fire News Release  For Immediate Release September 3, 2017Red Flag Warning In Effect Until 9PM Tonight POLSON, Mont. – The Red Flag Warning issued by the National Weather Service remains a big concern for firefighters over Labor Day. The public’s continued cooperation with the Stage 2 fire restrictions is a critical step in keeping everyone safe. High temperatures, combined with low relative humidity and wind, will test the work firefighters have recently completed on the Blue Bay Fire and other fires burning on the Flathead Reservation. On the Blue Bay Fire, containment lines have been tested during the past several days of hot, windy conditions. Despite some small spot fires detected in Okie Draw, acreage remains constant at 490 acres with 80% containment. Firefighters continue to work hard extinguishing heat sources on the fire. One firefighter experiencing heat related illness was transported to the hospital Saturday evening. To...", "content": "<div id=\"content\">\n<h3>Red Flag Warning In effect Until 9PM Tonight</h3><p><strong>Incident:</strong> Blue Bay Fire Wildfire<br/><strong>Released:</strong> 18 min. ago</p><p><b>Confederated Salish &amp; Kootenai Division of Fire News Release <br/></b> For Immediate Release September 3, 2017<br/><b>Red Flag Warning In Effect Until 9PM Tonight<br/> </b><br/>POLSON, Mont. – The Red Flag Warning issued by the National Weather Service remains a big concern for firefighters over Labor Day. The public’s continued cooperation with the Stage 2 fire restrictions is a critical step in keeping everyone safe. High temperatures, combined with low relative humidity and wind, will test the work firefighters have recently completed on the Blue Bay Fire and other fires burning on the Flathead Reservation.<br/> <br/>On the Blue Bay Fire, containment lines have been tested during the past several days of hot, windy conditions. Despite some small spot fires detected in Okie Draw, acreage remains constant at 490 acres with 80% containment. Firefighters continue to work hard extinguishing heat sources on the fire. One firefighter experiencing heat related illness was transported to the hospital Saturday evening. To reduce the risk to firefighters and public, the B-2000 and B-2200 Roads remain closed.<br/> <br/>The Liberty Fire southeast of Arlee, MT is roughly 16,788 acres and is 22% contained. Saturday evening, several wind shifts and strong wind gusts threw multiple spot fires across containment lines near the convergence of the South Fork of the Jocko River and Liberty Creek. 16 firefighters became entrapped by flame, 13 were able to escape to a safety zone while 3 began to deploy fire shelters. Another wind shift provided the 3 with the opportunity to escape to safety. All firefighters are safe, and there were no injuries reported. The South Fork Primitive Area is currently closed, and additional closures are currently in effect; please visit https://inciweb.nwcg.gov for more information.<br/> <br/>The 310-acre Black Fire is 0% contained and fire activity has picked up in recent days due to high temperatures, wind and low relative humidities. It is burning in the Mission Mountains Tribal Wilderness 3 miles north of Black Lake. Firefighters plan to use aircraft today to drop water in an effort to slow the fire’s growth to the north and east. The Confederated Salish &amp; Kootenai Division of Fire is coordinating firefighting efforts with the Montana DNRC – Southwest Land Office and Lolo National Forest. The Division of Fire asks the public to stay out of the North Fork trailhead area (Lost Sheep, Gray Wolf, and Buck Lake) due to the fire danger. Any questions, call the Division of Fire, 406-676-2550.<br/> <br/>The 620-acre Upper Midway Fire near Ravalli is contained, but not yet controlled. Firefighters will continue to extinguish remaining hot spots and monitor the area for flare ups and spot fires.<br/> <br/>Yesterday the 62 acre Cottonwood Fire began on private property in the Camas area. It is contained, however firefighters will continue to monitor it until it is deemed controlled.<br/> </p>\n</div>", "guidislink": false, "title_detail": {"base": "", "type": "text/plain", "value": "Red Flag Warning In effect Until 9PM Tonight (Blue Bay Fire Wildfire)", "language": null}, "link": "https://inciweb.nwcg.gov/incident/article/5507/39824/", "published": "Sun, 03 Sep 2017 10:12:00 -05:00", "article_id": "39824", "id": "https://inciweb.nwcg.gov/incident/article/5507/39824/"}