{"incident_id": "5507", "summary_detail": {"base": "", "type": "text/html", "value": "Confederated Salish & Kootenai Division of Fire News Release For Immediate Release  September 2, 2017Fire Safety Through Labor Day WeekendPOLSON, Mont. – The safety of firefighters and the public remains the number one priority as we enter Labor Day weekend under the most extreme fire conditions of recent years. The public’s continued cooperation with the Stage 2 fire restrictions is a critical step in keeping everyone safe. Weather remains a big concern for firefighters as the Labor Day weekend approaches. High temperatures, combined with low relative humidity and wind, will test the work firefighters have recently completed on the Blue Bay Fire and other fires burning on the Flathead Reservation.At the Blue Bay Fire, containment lines held well during the past several days of hot, windy conditions. Acreage remains at 490 acres and containment is 80 percent. Firefighters are addressing any hot spots they encounter while improving firelines. At this time, no additional community...", "language": null}, "links": [{"href": "https://inciweb.nwcg.gov/incident/article/5507/39725/", "type": "text/html", "rel": "alternate"}], "published_parsed": null, "title": "Fire Safety Through Labor Day Weekend (Blue Bay Fire Wildfire)", "summary": "Confederated Salish & Kootenai Division of Fire News Release For Immediate Release  September 2, 2017Fire Safety Through Labor Day WeekendPOLSON, Mont. – The safety of firefighters and the public remains the number one priority as we enter Labor Day weekend under the most extreme fire conditions of recent years. The public’s continued cooperation with the Stage 2 fire restrictions is a critical step in keeping everyone safe. Weather remains a big concern for firefighters as the Labor Day weekend approaches. High temperatures, combined with low relative humidity and wind, will test the work firefighters have recently completed on the Blue Bay Fire and other fires burning on the Flathead Reservation.At the Blue Bay Fire, containment lines held well during the past several days of hot, windy conditions. Acreage remains at 490 acres and containment is 80 percent. Firefighters are addressing any hot spots they encounter while improving firelines. At this time, no additional community...", "content": "<div id=\"content\">\n<h3>Fire Safety Through Labor Day Weekend</h3><p><strong>Incident:</strong> Blue Bay Fire Wildfire<br/><strong>Released:</strong> 4 hrs. ago</p><p><b><br/></b><b>Confederated Salish &amp; Kootenai Division of Fire News Release </b><b>For Immediate Release<br/> <br/> September 2, 2017</b><b><br/></b><b>Fire Safety Through Labor Day Weekend</b><br/>POLSON, Mont. – The safety of firefighters and the public remains the number one priority as we enter Labor Day weekend under the most extreme fire conditions of recent years. The public’s continued cooperation with the Stage 2 fire restrictions is a critical step in keeping everyone safe. Weather remains a big concern for firefighters as the Labor Day weekend approaches. High temperatures, combined with low relative humidity and wind, will test the work firefighters have recently completed on the Blue Bay Fire and other fires burning on the Flathead Reservation.<br/>At the Blue Bay Fire, containment lines held well during the past several days of hot, windy conditions. Acreage remains at 490 acres and containment is 80 percent. Firefighters are addressing any hot spots they encounter while improving firelines. At this time, no additional community meetings are planned unless significant fire activity occurs. To reduce the risk to firefighters and public, the B-2000 and B-2200 Roads remain closed.<br/>The Liberty Fire which is southeast of Arlee, is roughly 15,545 acres and is 22% contained. The Liberty Fire will transition from being managed as a single fire by Rohrer’s Great Basin Type 2 Team, to being managed as a branch of the Rice Ridge Fire by Poncin’s Type 1 Team. The branch will be directly supervised by the Confederated Salish &amp; Kootenai Division of Fire. The South Fork Primitive Area is currently closed, and additional closures are currently in effect; please visit https://inciweb.nwcg.gov for more information.<br/>Fire behavior on the 310-acre Black Fire has picked up in recent days due to high temperatures, wind and low relative humidities. This lightning-caused fire is burning in the Mission Mountains Tribal Wilderness 3 miles north of Black Lake. The fire is approximately 5 miles north of the Liberty Fire, and roughly 12 miles west of the Rice Ridge Fire near Seeley Lake. Firefighters plan to use aircraft today to drop water and retardant in an effort to slow the fire’s growth to the north and east. The Confederated Salish &amp; Kootenai Division of Fire is coordinating firefighting efforts with the Montana DNRC – Southwest Land Office and Lolo National Forest.<br/>The 620-acre Upper Midway Fire near Ravalli is 80 percent contained. Firefighters will continue to secure the fire edge, extinguish remaining hot spots and monitor the area for flare ups and spot fires during the day and night shifts. </p>\n</div>", "guidislink": false, "title_detail": {"base": "", "type": "text/plain", "value": "Fire Safety Through Labor Day Weekend (Blue Bay Fire Wildfire)", "language": null}, "link": "https://inciweb.nwcg.gov/incident/article/5507/39725/", "published": "Sat, 02 Sep 2017 10:44:00 -05:00", "article_id": "39725", "id": "https://inciweb.nwcg.gov/incident/article/5507/39725/"}