{"incident_id": "5558", "summary_detail": {"base": "", "type": "text/html", "value": "September 1, 2017, 7 A.M.Contact: John HamiltonPhone: 406-826-4345 or 406-529-5475 Inciweb: https://inciweb.nwcg.gov/incident/5558/  What: Sheep Gap and Deep Creek Fire Update Location: Sheep Gap fire is approximately 9 miles west of Plains, Plains-Thompson Falls Ranger District (T 20 North R 27 W Section 7); Deep Creek fire is approximately 12 miles northwest of Thompson Falls (T 23 North R 30 W Section 14) Size: Approximately 1,637 acres Containment: 0 Cause: Started by lightning August 29  The Sheep Gap and Deep Creek fires: Both fires were started by lightning earlier this week. A Type 3 organization was assigned management of the Deep Creek fire as well as the Sheep Gap fire as of this morning, September 1. The primary initial attack priorities on both fast-growing incidents is to first secure identified high-value resources while attempting to control these fires. Helicopters with buckets, heavy air tankers and single engine air tankers were utilized when available throughout...", "language": null}, "links": [{"href": "https://inciweb.nwcg.gov/incident/article/5558/39667/", "type": "text/html", "rel": "alternate"}], "published_parsed": null, "title": "09-01-2017_Sheep Gap Fire Update (Sheep Gap Wildfire)", "summary": "September 1, 2017, 7 A.M.Contact: John HamiltonPhone: 406-826-4345 or 406-529-5475 Inciweb: https://inciweb.nwcg.gov/incident/5558/  What: Sheep Gap and Deep Creek Fire Update Location: Sheep Gap fire is approximately 9 miles west of Plains, Plains-Thompson Falls Ranger District (T 20 North R 27 W Section 7); Deep Creek fire is approximately 12 miles northwest of Thompson Falls (T 23 North R 30 W Section 14) Size: Approximately 1,637 acres Containment: 0 Cause: Started by lightning August 29  The Sheep Gap and Deep Creek fires: Both fires were started by lightning earlier this week. A Type 3 organization was assigned management of the Deep Creek fire as well as the Sheep Gap fire as of this morning, September 1. The primary initial attack priorities on both fast-growing incidents is to first secure identified high-value resources while attempting to control these fires. Helicopters with buckets, heavy air tankers and single engine air tankers were utilized when available throughout...", "content": "<div id=\"content\">\n<h3>09-01-2017_Sheep Gap Fire Update</h3><p><strong>Incident:</strong> Sheep Gap Wildfire<br/><strong>Released:</strong> 24 hrs. ago</p><p>September 1, 2017, 7 A.M.</p><b>Contact:</b> John Hamilton<b>Phone: </b>406-826-4345 or 406-529-5475<b> Inciweb: </b><a href=\"https://inciweb.nwcg.gov/incident/5558/\">https://inciweb.nwcg.gov/incident/5558/</a><p><b> </b></p> <b>What:</b> <b style=\"mso-bidi-font-weight:normal\">Sheep Gap and Deep Creek Fire Update</b> <b>Location:</b> Sheep Gap fire is approximately 9 miles west of Plains, Plains-Thompson Falls Ranger District (T 20 North R 27 W Section 7); Deep Creek fire is approximately 12 miles northwest of Thompson Falls (T 23 North R 30 W Section 14) <b>Size:</b> Approximately 1,637 acres <b>Containment:</b> 0 <b style=\"mso-bidi-font-weight: normal\">Cause</b>: Started by lightning August 29 <b style=\"mso-bidi-font-weight: normal\"> </b><b style=\"mso-bidi-font-weight: normal\">The Sheep Gap and Deep Creek fires: </b>Both<b style=\"mso-bidi-font-weight:normal\"> </b>fires were started by lightning earlier this week. A Type 3 organization was assigned management of the Deep Creek fire as well as the Sheep Gap fire as of this morning, September 1. The primary initial attack priorities on both fast-growing incidents is to first secure identified high-value resources while attempting to control these fires. Helicopters with buckets, heavy air tankers and single engine air tankers were utilized when available throughout the work cycle. High winds associated with forecast red flag weather warnings curtailed these activities in the afternoon. Contingency lines were being constructed at strategic locations ahead of the Sheep Gap fire. Resources: Heavy air tankers and helicopters were also instrumental in moderating spread on the Deep Creek fire, which has no road access. Three engines were being utilized on the Sheep Gap fire. A 20-person crew is on the Deep Creek fire and approximately 50 personnel are assigned to the Sheep Gap fire. Structures: Both fires have structures and dwellings well below the incidents along roads, and pre-evacuation warnings have been issued to those residents. Homeowners that have been contacted have a clearly identifiable purple ribbon attached to those residences to aid in the rapid identification should evacuation procedures be implemented. A structure assessment specialist is presently going door-to-door through the area to ensure that people are aware of the situation. Hazards: Steep, rocky terrain and access to both fires is problematic. Very dry forest fuels and continuing hot and dry weather are complicating factors. The rugged terrain is very challenging for on-the-ground forces. If you fly, we can’t! The use of unmanned aircraft (drones) is illegal near forest fires and can force the grounding of firefighting aircraft, jeopardize firefighter and pilot safety and impede successful suppression. Please, don’t be the person that helps this fire escape.<br/> <br/>Closures: Road Nos. 7583 and 7589, and Road No. 217 after the junction with 7589 are closed. Trails 385 (Sacajawea Peak), 398 (Dee Creek) and 1400 (West Fork of Swamp Creek) are also closed. See Inciweb for additional area closure information: <a href=\"https://inciweb.nwcg.gov/incident/closures/5558/\">https://inciweb.nwcg.gov/incident/closures/5558/</a>. Area closures for public and firefighter safety will be established today around both of these fires.\r\n\t\t</div>", "guidislink": false, "title_detail": {"base": "", "type": "text/plain", "value": "09-01-2017_Sheep Gap Fire Update (Sheep Gap Wildfire)", "language": null}, "link": "https://inciweb.nwcg.gov/incident/article/5558/39667/", "published": "Fri, 01 Sep 2017 14:11:00 -05:00", "article_id": "39667", "id": "https://inciweb.nwcg.gov/incident/article/5558/39667/"}