{"incident_id": "5558", "summary_detail": {"base": "", "type": "text/html", "value": "Sheep Creek and Deep Creek Fires UpdateSeptember 2, 2017, 7 A.M. Phone: 406-826-4345 or 406-529-5475 Inciweb: https://inciweb.nwcg.gov/incident/5558/ Contact: John Hamilton  What: Sheep Gap and Deep Creek Fires Update Location: Fire is approximately 9 miles west of Plains, Plains-Thompson Falls Ranger District (T 20 North R 27 W Section 7), Deep Creek Fire is approximately 12 miles northwest of Thompson Falls, (T 23 North R 30 W Section 14) Size: Sheep Gap 2,242 acres, Deep Creek 533 acres Containment: 0 Cause: Started by lightning Aug. 29 (Sheep Gap), Aug. 30 (Deep Creek)  The Sheep Gap and Deep Creeks Fires: The Sheep Gap and Deep Creek fires were started by lightning earlier this week and are currently being managed jointly under a local incident management team. Pre-evacuation notices have been issued to residents near both fires, for the River Road West and West Fork Swamp areas on the Sheep Gap fire, and for the Blue Slide road area for the Deep Creek fire. The primary...", "language": null}, "links": [{"href": "https://inciweb.nwcg.gov/incident/article/5558/39767/", "type": "text/html", "rel": "alternate"}], "published_parsed": null, "title": "9-2-2017 Sheep Gap & Deep Creek Fires Update (Sheep Gap Wildfire)", "summary": "Sheep Creek and Deep Creek Fires UpdateSeptember 2, 2017, 7 A.M. Phone: 406-826-4345 or 406-529-5475 Inciweb: https://inciweb.nwcg.gov/incident/5558/ Contact: John Hamilton  What: Sheep Gap and Deep Creek Fires Update Location: Fire is approximately 9 miles west of Plains, Plains-Thompson Falls Ranger District (T 20 North R 27 W Section 7), Deep Creek Fire is approximately 12 miles northwest of Thompson Falls, (T 23 North R 30 W Section 14) Size: Sheep Gap 2,242 acres, Deep Creek 533 acres Containment: 0 Cause: Started by lightning Aug. 29 (Sheep Gap), Aug. 30 (Deep Creek)  The Sheep Gap and Deep Creeks Fires: The Sheep Gap and Deep Creek fires were started by lightning earlier this week and are currently being managed jointly under a local incident management team. Pre-evacuation notices have been issued to residents near both fires, for the River Road West and West Fork Swamp areas on the Sheep Gap fire, and for the Blue Slide road area for the Deep Creek fire. The primary...", "content": "<div id=\"content\">\n<h3>9-2-2017 Sheep Gap &amp; Deep Creek Fires Update</h3><p><strong>Incident:</strong> Sheep Gap Wildfire<br/><strong>Released:</strong> 1:45 hrs. ago</p><p><p>Sheep Creek and Deep Creek Fires Update<font face=\"Verdana\"><b><br/></b></font><font face=\"Verdana\">September 2, 2017, 7 A.M.</font> Phone: 406-826-4345 or 406-529-5475 Inciweb: https://inciweb.nwcg.gov/incident/5558/</p> <p>Contact: John Hamilton </p> <p>What: Sheep Gap and Deep Creek Fires Update<br/> Location: Fire is approximately 9 miles west of Plains, Plains-Thompson Falls Ranger District (T 20 North R 27 W Section 7), Deep Creek Fire is approximately 12 miles northwest of Thompson Falls, (T 23 North R 30 W Section 14)<br/> Size: Sheep Gap 2,242 acres, Deep Creek 533 acres<br/> Containment: 0<br/> Cause: Started by lightning Aug. 29 (Sheep Gap), Aug. 30 (Deep Creek) </p> <p>The Sheep Gap and Deep Creeks Fires: The Sheep Gap and Deep Creek fires were started by lightning earlier this week and are currently being managed jointly under a local incident management team. Pre-evacuation notices have been issued to residents near both fires, for the River Road West and West Fork Swamp areas on the Sheep Gap fire, and for the Blue Slide road area for the Deep Creek fire. The primary objectives for both fires is to first secure identified resources of value and structures in the vicinity of each incident while attempting to contain both. Contingency lines are being constructed on the Sheep Gap fire in case the fire moves towards the east or north where structures are located. Helicopters with buckets, heavy air tanker retardant and single engine air tanker retardant planes continue to be utilized to help contain fire spread. Continuing hot and dry weather, with temperatures forecast to be well into the 90s for the next several days, are another factor affecting fire behavior on all fires burning in the area. </p> <p>Resources: Resources assigned to the incidents include 51 personnel, several engines and a structure assessment group on the Sheep Gap fire, and two 20-person crews on the Deep Creek fire. Structure assessment and pre-evacuation planning is also ongoing on the Deep Creek fire.<br/> Both fires will continue to utilize helicopters with buckets and retardant planes as available and needed. </p> <p>Structures: Both fires have structures and dwellings below the incidents along roads, and pre- evacuation warnings have been issued to those residents determined to be possibly affected. Homeowners have been advised to keep informed on current fire conditions and to be prepared as possible in the event that evacuations are implemented by the Sanders County Sheriff’s office. </p> <p>Hazards: Steep, rocky terrain on both fires and access to both is problematic. Very dry forest fuels and continuing hot and dry weather are complicating factors. The hunting season for upland game birds and archery starts today in Montana, meaning more people will be out and the risk of new fire starts will increase. </p> <p>If you fly, we can’t! The use of unmanned aircraft (drones) is illegal near forest fires and can force the grounding of firefighting aircraft, jeopardize firefighter and pilot safety and impede successful suppression. </p> <p>Closures: Roads and trails in both fire areas have been closed. Please see those area closure orders for more information on specific roads and trails. Please access Inciweb at https://inciweb.nwcg.gov/incident/closures/5558/ for all roads and trails affected. </p> </p>\n</div>", "guidislink": false, "title_detail": {"base": "", "type": "text/plain", "value": "9-2-2017 Sheep Gap & Deep Creek Fires Update (Sheep Gap Wildfire)", "language": null}, "link": "https://inciweb.nwcg.gov/incident/article/5558/39767/", "published": "Sat, 02 Sep 2017 12:50:00 -05:00", "article_id": "39767", "id": "https://inciweb.nwcg.gov/incident/article/5558/39767/"}