{"incident_id": "5585", "summary_detail": {"base": "", "type": "text/html", "value": "West Fork Fire Fact SheetSeptember 3, 2017 Location: West Fork Fire is located 5 miles North of Kootenai River Road. Cause: Lightning Current Size: 1600 acres Contact: westforkfire2017@gmail.com Announcement: A public meeting will be held for the West Fork Fire on Sunday September 3, 2017 at 4:00 PM at Libby Middle/High School, 150 Education Way, Libby, MT. Fire: The West Fork Fire is located in the Quartz Creek/Bobtail Ridge area on the Libby Ranger District. The West Fork Fire started Wednesday morning. A local Type 3 Fire Response Team is in place providing fire suppression strategies. The team will continue to use heavy equipment to construct shaded fuel breaks with weather dictating line construction activities. The Fire Team is using J. Neil’s Park to stage equipment. Please be cautious and drive slowly when accessing the park. Evacuations: Lincoln County Sheriff’s Office is working closely with local fire departments and the Fire Response Team to identify opportunities to...", "language": null}, "links": [{"href": "https://inciweb.nwcg.gov/incident/article/5585/39854/", "type": "text/html", "rel": "alternate"}], "published_parsed": null, "title": "Fire Update Sept 3 (West Fork Fire Wildfire)", "summary": "West Fork Fire Fact SheetSeptember 3, 2017 Location: West Fork Fire is located 5 miles North of Kootenai River Road. Cause: Lightning Current Size: 1600 acres Contact: westforkfire2017@gmail.com Announcement: A public meeting will be held for the West Fork Fire on Sunday September 3, 2017 at 4:00 PM at Libby Middle/High School, 150 Education Way, Libby, MT. Fire: The West Fork Fire is located in the Quartz Creek/Bobtail Ridge area on the Libby Ranger District. The West Fork Fire started Wednesday morning. A local Type 3 Fire Response Team is in place providing fire suppression strategies. The team will continue to use heavy equipment to construct shaded fuel breaks with weather dictating line construction activities. The Fire Team is using J. Neil’s Park to stage equipment. Please be cautious and drive slowly when accessing the park. Evacuations: Lincoln County Sheriff’s Office is working closely with local fire departments and the Fire Response Team to identify opportunities to...", "content": "<div id=\"content\">\n<h3>Fire Update Sept 3</h3><p><strong>Incident:</strong> West Fork Fire Wildfire<br/><strong>Released:</strong> 28 min. ago</p>\n<!-- \ncached related article links at 12:00:14\ncached id 5378b990bef14bf65f3266e9d54d3426\n-->\n<div id=\"related_block\"><h4 id=\"related_head\">Related Information</h4><ul class=\"related_list\"><li><a href=\"https://inciweb.nwcg.gov/photos/MTKNF/2017-09-03-1103-West-Fork-Fire/related_files/pict20170803-113417-0.pdf\" rel=\"new\">West Fork Fire Aug 3  PDF (pdf 187 kb)</a></li></ul></div><p><b><font size=\"2\">West Fork Fire </font></b><br/><font size=\"2\">Fact Sheet<br/>September 3, 2017 <br/><br/>Location: West Fork Fire is located 5 miles North of Kootenai River Road.<br/> Cause: Lightning Current Size: 1600 acres <br/>Contact: westforkfire2017@gmail.com <br/>Announcement: A public meeting will be held for the West Fork Fire on Sunday September 3, 2017 at 4:00 PM at Libby Middle/High School, 150 Education Way, Libby, MT. <br/><br/>Fire: The West Fork Fire is located in the Quartz Creek/Bobtail Ridge area on the Libby Ranger District. The West Fork Fire started Wednesday morning. A local Type 3 Fire Response Team is in place providing fire suppression strategies. The team will continue to use heavy equipment to construct shaded fuel breaks with weather dictating line construction activities. The Fire Team is using J. Neil’s Park to stage equipment. Please be cautious and drive slowly when accessing the park. <br/><br/>Evacuations: Lincoln County Sheriff’s Office is working closely with local fire departments and the Fire Response Team to identify opportunities to work with landowners to keep them aware of the fire situation. A Pre-Evacuation Warning has been issued by the Lincoln County Sheriff’s Office for the upper end of Bobtail Road north of Bobtail Cutoff, Hutton Drive, Bobtail Cut-off, including Winter Road and Whitetail Road, Pipe Creek Road from Forest Way, including Lodge Pole Road, Blue Mountain Lookout Road and Doak Creek Road, and Creekside Road to 17 Mile Road. <br/><br/>Closures: Go to the Kootenai webpage at https://www.fs.usda.gov/kootenai for the latest on Closure Orders and KNF fire vicinity map. Lincoln County Sheriff’s Office is asking the public to avoid the Pipe Creek Road, Kootenai River Road, Quartz Creek Road, Quartz Mountain Road, Bobtail Road and Bobtail Cutoff areas to allow for safe fire response and public safety. The fall hunting season officially started yesterday with archery season, please avoid active fire areas. Forecasted Weather: A red flag warning will be in effect on Sunday from noon to 9:00 PM. Hot and dry conditions will continue today with breezy afternoon winds. Winds are expected to pick up sometime between 3 and 6 pm. A Canadian cold front will bring a shift in wind direction Sunday night with winds becoming north to northeasterly. The fire is actively burning so people can expect to see smoke in the air. Check todaysair.mt.gov for real time updates on air quality and outdoor activity recommendations. <br/><br/>Fire Restrictions: Stage II Fire Restrictions are in effect for Lincoln County and Kootenai National Forest due to extreme fire danger. Current fire conditions can be found at www.firerestrictions.us. </font></p>\n</div>", "guidislink": false, "title_detail": {"base": "", "type": "text/plain", "value": "Fire Update Sept 3 (West Fork Fire Wildfire)", "language": null}, "link": "https://inciweb.nwcg.gov/incident/article/5585/39854/", "published": "Sun, 03 Sep 2017 11:32:00 -05:00", "article_id": "39854", "id": "https://inciweb.nwcg.gov/incident/article/5585/39854/"}